#### Terraform Plan for `dev` 📋 ✅ Success

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
random_string.suffix: Refreshing state... [id=jc1cln]
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-demo-dev]
azurerm_storage_account.main: Refreshing state... [id=/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-demo-dev/providers/Microsoft.Storage/storageAccounts/stdemodevjc1cln]
azurerm_storage_container.demo: Refreshing state... [id=/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-demo-dev/providers/Microsoft.Storage/storageAccounts/stdemodevjc1cln/blobServices/default/containers/demo-data]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_storage_container.demo2 will be created
  + resource "azurerm_storage_container" "demo2" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "demo-data2"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = "/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-demo-dev/providers/Microsoft.Storage/storageAccounts/stdemodevjc1cln"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```

</details>

**Exit Code:** 0

*Pusher: @torivarm, Action: `pull_request`, Workflow: `Terraform CI`*